// Написать функцию, которая принимает 2 числа и возвращает -1, если первое меньше,
//  чем второе; 1 – если первое больше, чем второе; и 0 – если числа равны.
/*
function comparisonNumbers(num1, num2) {
    if (num1 > num2) return 1;
    if (num1 < num2) return -1;
    if (num1 === num2) return 0;
}
console.log(comparisonNumbers(32, 32));

// Написать функцию, которая вычисляет факториал переданного ей числа.

function factorial(length) {
    let factorialNumber = 1;
    for (let i = 2; i <= length; i++) {
        factorialNumber = factorialNumber * i;
    }
    return factorialNumber;
}

// Написать функцию, которая принимает три отдельные цифры и превращает их в одно число.
//  Например: цифры 1, 4, 9 превратятся в число 149.

function transformeOfNumber(firstNum, secondNum, thirdNum){
    let num = firstNum * 100 + secondNum * 10 + thirdNum;
    return num;
}

// Написать функцию, которая принимает длину и ширину прямоугольника и вычисляет его площадь.
//  Если в функцию передали 1 параметр, то она вычисляет площадь квадрата.

function area(length, width) {
    let area;
    if (width === undefined || width === undefined) area = length * length;
    else area = length * width;
    return area;
}

// Написать функцию, которая проверяет, является ли переданное ей число совершенным.
//  Совершенное число – это число, равное сумме всех своих собственных делителей.
*/
function perfectNumber(num) {
    let sum = 0;
    let resNum = num;
    while (resNum !== 0){
        sum = sum + resNum % 10;
        resNum = ~~(resNum / 10);
    }
    if(sum === num) return true;
    else return false;
}
console.log(perfectNumber())
// Написать функцию, которая принимает минимальное и максимальное значения для диапазона,
//  и выводит только те числа из диапазона, которые являются совершенными.
//   Используйте написанную ранее функцию, чтобы узнавать, совершенное число или нет. 


// Написать функцию, которая принимает время (часы, минуты, секунды) и выводит его на 
// экран в формате «чч:мм:сс».Если при вызове функции минуты и/или секунды не были переданы, то выводить их как 00.


// Написать функцию, которая принимает часы, минуты и секунды и возвращает это время в секундах.


// Написать функцию, которая принимает количество секунд, переводит их в часы, минуты и
//  секунды и возвращает в виде строки «чч:мм:сс».


// Написать функцию, которая считает разницу между датами. Функция принимает 6 параметров,
//  которые описывают 2 даты, и возвращает результат в виде строки «чч:мм:сс».
//   При выполнении задания используйте функции из предыдущих 2-х заданий: сначала
//    обе даты переведите в секунды, узнайте разницу в секундах, а потом разницу переведите обратно в «чч:мм:сс»
